[
  "dataview",
  "calendar",
  "periodic-notes",
  "customjs",
  "obsidian-text-format",
  "templater-obsidian",
  "obsidian-excalidraw-plugin",
  "obsidian-to-anki-plugin",
  "squiggle",
  "obsidian-citation-plugin",
  "obsidian-linter",
  "obsidian-file-cleaner",
  "obsidian-regex-replace",
  "obsidian-charts",
  "advanced-cursors",
  "supercharged-links-obsidian",
  "graph-analysis",
  "metadata-menu",
  "breadcrumbs",
  "hot-reload",
  "rationalia-plugin"
]