[
  "dataview",
  "templater-obsidian",
  "obsidian-linter",
  "supercharged-links-obsidian",
  "metadata-menu",
  "hot-reload",
  "breadcrumbs",
  "obsidian-to-anki-plugin",
  "obsidian-citation-plugin",
  "rationalia-plugin"
]