[
  {
    "title": "80-20",
    "body": "To “80-20” something is to obtain most of the result (80%) with only a small proportion of the work (20%). This expression originates with the Pareto principle which states that for many events, 80% of the effects come from 20% of the causes (e.g. most of a com- pany’s sales come from a small number of its clients).  \n "
  },
  {
    "title": "Adaptive problem",
    "body": "A problem whose solution contains steps or methods that are unknown or uncertain, often requiring experimentation, novel strategies, or entirely new ways of thinking. Contrast with “technical problems,” which may be equally difficult but whose difficulty lies in the execution of known or knowable processes.  \n "
  },
  {
    "title": "Affect",
    "body": "One’s emotional state or disposition, especially as evidenced by one’s body language, facial expression, word choice, and tone of voice.  \n "
  },
  {
    "title": "Affordance",
    "body": "An opportunity or potential-for-action arising from a given context; a door handle creates an *affordance* for pulling. In particular, it is a *genuine* or *felt* opportunity—while there may be no physical difference between picking up a pen on one’s own desk, one’s coworker’s desk, one’s manager’s desk, or the CEO’s desk, each of those contexts provides a different degree of affordance.  \n "
  },
  {
    "title": "Againstness",
    "body": "The quality of resistance to information, often caused by strong emotion or sympathetic nervous system activation, but also resulting from conflicts with one’s identity, inherent biases, and other entangled beliefs.  \n "
  },
  {
    "title": "Agency",
    "body": "The property of both having and exercising a capacity for relevant action; one’s ability to meaningfully affect the world around oneself and effectively move toward achieving one’s goals. In particular, agency implies the ability to move beyond default patterns and cached answers, and to think and act strategically. Because it is not possible to achieve agency in a total sense, CFAR often refers to being more or less “agent**y.**”  \n "
  },
  {
    "title": "Alief",
    "body": "A deeply-felt belief, sometimes called an “anticipation,” emerging naturally from one’s mental model of the universe. Sometimes contradictory to one’s *professions*, which are explicitly stated beliefs—for instance, one might profess/believe that a high wooden bridge over a canyon is entirely safe, and yet reveal an anticipation/alief of danger by tensing, moving gingerly, and refusing to look down.  \n "
  },
  {
    "title": "Aumanning",
    "body": "From Aumann’s agreement theorem, which demonstrates that two rational agents with the same back- ground beliefs cannot disagree. Aumanning refers to one of several processes (such as double crux) for resolving disagreement by converging on a shared model of reality.  \n "
  },
  {
    "title": "Aversion",
    "body": "An internal repulsion or desire-to-avoid, sometimes referred to as a “yuck factor” or “ugh field.” Aversions may have clearly identifiable sources and mechanisms (e.g. aversion to exercise related to feelings of heat, sweatiness, pain, or exhaustion), or they may be difficult to pin down (or entirely unconscious). Typically, aversions either cause one to spend less time and energy interacting with a person/task/activity, or color those interactions with pain or stress.  \n "
  },
  {
    "title": "Aversion Factoring",
    "body": "A technique for addressing aversions by first zeroing in on their concrete, immediate sources and then evaluating each aversion for validity or relevance and taking steps accordingly.  \n "
  },
  {
    "title": "Bayesian Updating",
    "body": "A method of shifting belief in response to new evidence, derived from Bayes’ Theorem in statistics. Formal Bayesian updating requires use of a mathematical formula, but a rough, approximate version involves stating an explicit belief with a given probability (a “prior”), evaluating the degree to which new evidence bears upon that belief, and making an incremental adjustment to one’s evaluation of its likelihood in response, resulting in a “posterior” that is meaningfully different.  \n "
  },
  {
    "title": "Belief",
    "body": "An explicit opinion or belief, sometimes called a \"profession,\" expressible in words. Sometimes contradictory to one’s anticipations, which are intuitive, felt beliefs—for instance, one might anticipate/alieve that a high wooden bridge over a canyon is dangerous, and tense and move gingerly, but if one professes/believes that the bridge is, in fact, safe, one will still walk across it without much hesitation.  \n "
  },
  {
    "title": "Bias",
    "body": "A systematic distortion of one’s actions or reasoning due to factors not relevant to the situation at hand (e.g. one might reject a new policy recommendation out of a “status quo bias,” in which one favors current ways of doing things regardless of cost or opportunity).  \n "
  },
  {
    "title": "Black Swan",
    "body": "A rare and essentially unpredictable event with significant negative consequences. Classic examples of black swans include things like meteor strikes, the 9/11 terrorist attacks, the sinking of the Titanic, and the arrival of Europeans in the New World (from the perspective of the indigenous populations). The term is also used metaphorically, to refer to events with disproportionate and unexpected personal or small-group impact.  \n "
  },
  {
    "title": "Blindsight",
    "body": "Classically, an effect whereby individuals with certain types of blindness can nevertheless “see” in the sense that their unconscious mind is processing information that they are not consciously aware of. These individuals can correctly identify the position of lit dots on a black screen by “guessing,” at a rate far higher than chance would allow. Metaphorically, blindsight is used to refer to instinctive or visceral knowledge that tends to be more correct than one would expect, thanks to accurate processing by one’s subconscious processes.  \n "
  },
  {
    "title": "Boggle!",
    "body": "An imperative reminder to embrace confusion and seek deeper understanding. One is more likely to learn and grow if one boggles at unclear phenomena than if one merely shrugs and moves on.  \n "
  },
  {
    "title": "Bucket Error",
    "body": "A mistake occurring when people misunderstand the relationship between various bits of information, such that an update about A forces an unjustified or inaccurate update about B, which are more tightly linked in one's mind than in reality.  \n "
  },
  {
    "title": "Bug",
    "body": "A negative emotion or outcome (assumed to be solvable) that results from one’s current habits, beliefs, or ways of being, or an unfulfilled potential (assumed to be achievable) regarding one’s well-being, abilities, or position in life. Often bugs can be thought of metaphorically as “glitches” in a computer program—one is pursuing one’s goals according to processes that mostly work, but there are unexpected or unpleasant side-effects.  \n "
  },
  {
    "title": "Button Test",
    "body": "A tool for eliciting System 1 responses, in which one pretends that a given outcome can be achieved with the press of a button. By pretending that one is about to push the button, one often finds reasons to hesitate or notices previously unacknowledged factors or assumptions.  \n "
  },
  {
    "title": "Calibration",
    "body": "The process of causing one’s beliefs and expectations to match reality, most often expressed probabilistically (e.g. “If you look at all of the times I say I’m 75% sure, I’m right three out of four.”).  Usually, calibration is treated as a skill, and practiced explicitly, as by spending a month making hundreds of predictions and seeing how many of them turned out as you thought they would.  \n "
  },
  {
    "title": "CBT",
    "body": "Cognitive behavioral therapy, a type of psychotherapy in which negative patterns of thought about oneself and the world are directly challenged, resulting in a change in overall behavior patterns or general mood.  \n "
  },
  {
    "title": "Chesterton's Fence",
    "body": "A philosophical parable, stating that if one comes across a seemingly-purposeless fence in the middle of the desert, one should not take it down. Often used in social or psychological contexts as a reminder that one’s inability to see a reason for a given structure, habit, or institution is not evidence that no such reason exists.  \n "
  },
  {
    "title": "Circling",
    "body": "A specialized form of conversation popular among rationalists, in which the *subject* of the conversation is the *subjective experience* of the conversation, as it is unfolding.   \n "
  },
  {
    "title": "Consequentialism",
    "body": "An ethical theory holding that the *consequences* of an action are the sole and ultimate basis for judgements as to that actions rightness or wrongness. Like deontology, consequentialism asks the question “what sort of actions should I take?  \n "
  },
  {
    "title": "CoZE",
    "body": "Comfort zone exploration, a technique in which fears and aversions are tested under limited, safe circumstances such that experience and evidence can be used to evaluate their validity. CoZE is related to exposure therapy, in which aversions are reduced or excised through gradual and repeated exposure, but is meaningfully different in that it does not take for granted that a given aversion is inappropriate. The goal of CoZE is to build a more *accurate* set of anticipations, such that one feels averse only to actions which present actual dangers or difficulties, and not to those which merely *seem* hazardous.  \n "
  },
  {
    "title": "Counterfactual",
    "body": "An evaluation of near-identical circumstances in which one element is changed and the outcome therefore potentially different. If one performs CPR on a drowning victim, the counterfactual is the universe in which one did not, raising questions like “did someone else, and how good of a job did they do, relative to me?”  \n "
  },
  {
    "title": "Debugging",
    "body": "The general term for processes which seek to resolve bugs, whether internal/emotional/motivational or external/logistical/actionable. Often, debugging involves brainstorming, introspection, the making and refining of plans, the development of theories or cheap experiments, the application of specific algorithms (such as CFAR techniques), and the help of one or more partners who provide support, accountability, and sanity checks.  \n "
  },
  {
    "title": "Declarative Knowledge",
    "body": "Also called explicit knowledge.  A type of knowledge that one can directly communicate (“declare”), usually in words but also in diagrams or other explicit media. Facts one knows (e.g., “The capitol city of France is Paris”) are declarative knowledge, as are understandings that one can potentially express (e.g., the mathematical description of Newtonian gravity). One can have declarative knowledge of how to do something without being able to do it, such as knowing what’s involved in throwing a dart to hit a bullseye without having the skill. Contrast with “procedural knowledge.”  \n "
  },
  {
    "title": "Deontology",
    "body": "An ethical theory holding that actions should be judged according to their adherence to moral norms and rules. Like consequentialism, deontology asks the question “what sort of actions should I take?”  \n "
  },
  {
    "title": "Diachronic",
    "body": "Contrasts with \"episodic.\"  A sense of consistency-of-self across time, such that a person identifies strongly with their past and future selves, and has the experience of persistence and narrative connection even on time scales of months, years, or decades.  \n "
  },
  {
    "title": "Double Crux",
    "body": "An explicit algorithm for guiding honest disagreement toward productive resolution, by keeping discussion focused on the factors that have the potential to influence proponents of either side. In double crux, participants seek “cruxes” for their argument—provable/falsifiable binary statements whose outcome would either confirm their core belief, or cause them to abandon/update it. If both participants share and disagree upon a given statement that is a crux for each of them, then that “double crux” can be productively investigated, and the resulting evidence will bring them into agreement.  \n "
  },
  {
    "title": "Effective Altruism",
    "body": "Abbreviated as “EA,” both a philosophy and a group of organizations based upon that philosophy. Effective altruism is a means for comparing and evaluating various strategies for doing good; effective altruists believe that, for a given amount of money/resources/effort/goodwill, it is best to find the application that maximizes total utility, regardless of cause, nationality, personal emotional investment, or distance.  \n "
  },
  {
    "title": "Episodic",
    "body": "Contrasts with \"diachronic.\"  A sense of changeability over time, such that a person feels dissociation or disconnect from past and future selves, and has the experience of \"molting\" or \"evolving\" or \"becoming a new version of themselves\" fairly regularly.  \n "
  },
  {
    "title": "Epistemics",
    "body": "The construction of formal models of the processes by which knowledge and understanding are achieved and communicated. Similar to epistemology (the philosophical theory of knowledge), epistemics is a field concerned with what we know, and how we know that we know it. CFAR participants and instructors will often distinguish between “good and bad epistemics,” by which they mean beliefs and thought processes that are well-justified and closely matched to reality versus those that are not.  \n "
  },
  {
    "title": "Existential Risk",
    "body": "Any process or event with the capacity to extinguish or permanently curtail all human or all Earth-based life. Examples include nuclear war, asteroid impacts, epidemics, climate change, and scalable, high-impact technologies such as bioengineering or artificial intelligence.  \n "
  },
  {
    "title": "Expected Value",
    "body": "Often abbreviated “EV,” this is the amount of some good (“value”) one mathematically expects given an appropriately weighted average of the possible outcomes of an uncertain situation. For instance, if on a fair coin toss you will gain $4 for each heads but lose $2 for each tails, then the EV of this situation is $1. That is to say, after taking many such bets, you should expect to gain on average $1 per coin toss.  \n "
  },
  {
    "title": "Factoring",
    "body": "A general application of reductionism/the LEGO principle, in which one assumes that any given urge, belief, or emotion is likely to be made up of discrete, distinguishable parts, and then seeks to identify those parts so that they may be evaluated independently of one another (and thus, in theory, more accurately).  \n "
  },
  {
    "title": "Felt Sense",
    "body": "From Gendlin's Focusing, a general term for one's overall physiological and emotional response to a given person, domain, or topic.  e.g. \"when I think about my looming deadline, I get a strong, doomy *felt sense* that partially expresses itself as this heavy feeling in my shoulders.\"  See also \"handle.\"  \n "
  },
  {
    "title": "Fermi Estimate",
    "body": "A quick, “back-of-the-envelope” calculation used to arrive at rough estimates, usually deliberately obfuscating detail within an order of magnitude and relying on opposing errors to roughly cancel one another out (e.g. “There are about 100 minutes in an hour, about 10 hours in a day, about 10 days in a week, about 5 weeks in a month, and about 10 months in a year, so there’s something in the neighborhood of 500,000 minutes in a year.”)  \n "
  },
  {
    "title": "Focusing",
    "body": "A therapeutic technique developed by Eugene Gendlin, in which patients use close attentiveness to physiological sensation and resonance with various salient, descriptive terms for their problems and feelings as tools for developing a better sense of which things are emotionally salient to them.  \n "
  },
  {
    "title": "Gears-level",
    "body": "A thorough and procedural understanding of a given concept or process, such that its workings seem obvious or inevitable and one can intelligently alter or engineer it, with predictable outcomes.  \n "
  },
  {
    "title": "Gendlin, Eugene",
    "body": "Creator of the Focusing technique, and the Litany of Gendlin, paraphrased as “what is true is already so; owning up to it doesn’t make it worse, and ignoring it doesn’t make it go away.”  \n "
  },
  {
    "title": "Good Faith Principle",
    "body": "A principle of productive debate which states that, in any given disagreement, it is best to assume that all agents are acting in good faith, are seeking actual resolution, and want good things for all involved par- ties and the world. The Good Faith Principle may be applied interpersonally, as in Double Crux, or intrapersonally, as in Propagating Urges.  \n "
  },
  {
    "title": "Growth Mindset",
    "body": "A mental orientation in which one takes as a given one’s ability to learn new skills and improve one’s quality of life (as opposed to thinking of those things as determined by luck or genetics or some other factor beyond one’s control). According to Carol Dweck, who first developed and popularized the concept, individuals with a strong growth mindset see setbacks as opportunities and tend to be more resilient, more able to sustain motivation, and ultimately happier and more successful.  \n "
  },
  {
    "title": "Hamming, Richard",
    "body": "A scientist at Bell Laboratories in the mid-twentieth century, and generator of the Ham- ming Question, paraphrased as “what is the most important problem facing me in this moment, and what are the things that are keeping me from working on it?” At CFAR, instructors and participants will often form “Hamming circles” to help one another articulate and solve “Hamming problems,” in answer to that question.  \n "
  },
  {
    "title": "Handle",
    "body": "From Gendlin's Focusing, a general term for the explicit label or description that resonates with one's felt sense. e.g. \"there's this floating, expansive feeling in my chest, and it's because I am *finally free.\"*  In this example, \"finally free\" would be the handle, where the floating, expansive feelings in the chest would be the felt sense.  \n "
  },
  {
    "title": "Heuristic",
    "body": "A quick-and-dirty decision-making or problem-solving algorithm, sometimes inaccurate in specifics but useful for reaching approximate solutions with incomplete data or inadequate time. Heuristics may be more or less appropriate, depending on circumstances; the field of “heuristics and biases” research takes a measured look at the ways in which our evolutionary history and brain structure cause us to make systematic, predictable mistakes. Much of CFAR’s content is concerned with identifying and repairing poor heuristics, and forming and leveraging useful ones. See “Fermi estimate.”  \n "
  },
  {
    "title": "Hyperbolic Discounting",
    "body": "An effect in operant conditioning and behavior modification whereby the proximity of punishment or reinforcement to the behavior being punished or reinforced has a disproportionately large impact on the speed and permanence of the behavior change. When providing (e.g.) a treat to a dog as a reward for doing a trick, the difference between a delay of a tenth of a second and a delay of half a second is highly significant, and much more significant than a difference of the same magnitude between one second and one-point-four seconds. This swift drop-off in efficacy is the justification for “clicker training,” in which a click is first associated with a tangible reward, and then used as the reinforcer—the click can be delivered practically instantaneously, providing much stronger reinforcement than a tossed treat that takes half a second to arrive.  \n "
  },
  {
    "title": "IDC",
    "body": "Internal Double Crux, a CFAR technique for resolving internal confusion or conflict via a process of facilitating an explicit dialogue between different perspectives or subagents wanting and believing different things.  \n "
  },
  {
    "title": "Idea Inoculation",
    "body": "An effect whereby seeing a weak or poorly-explained version of a concept defeated or disproven makes one less receptive to that and similar concepts in the future, even if the future versions are strong and well-justified.  \n "
  },
  {
    "title": "Illusion of Transparency",
    "body": "The tendency to overestimate the degree to which others understand our statements or our mental state. Often operationalized as the “double illusion of transparency,” in which Person A thinks they have communicated a concept clearly, and Person B thinks they have understood, when in fact what has been transmitted is something else entirely.  \n "
  },
  {
    "title": "Inferential Distance",
    "body": "Also referred to as “inferential gaps;” a measure of the mental distance between one’s current understanding and the level of understanding required to grasp a given new concept or idea. For example, it is possible to explain the Pythagorean Theorem to a bright fifth grader, but easier to explain it to a seventh grader since exposure to the principles of algebra has reduced the inferential gap.  \n "
  },
  {
    "title": "Inner Simulator",
    "body": "One’s internal, implicit mental model of the universe, drawing on all of one’s experiences and conclusions about “how the world works,” such that one can envision a scenario (e.g. a laptop balanced on the edge of a table, or a particular joke said aloud at a party) and intuit the outcome, without the need for explicit reasoning.  \n "
  },
  {
    "title": "Inside View",
    "body": "One’s personal view of a situation, implying both intimate self-knowledge and also exposure to bias and misjudgment. The inside view tends to be optimistic, self-forgiving, and based upon an assumption of individual agency and control. Contrast with “outside view.”  \n "
  },
  {
    "title": "IFS",
    "body": "Internal Family Systems, derived from Family Systems.  IFS is a school of psychotherapy which views the mind as composed of various parts or subpersonalities, each with its own perspective, interests, memories, and viewpoint, and each with positive intent for the overall person. IFS posits that stress and tension often come from conflict between these subpersonalities (especially when some of the perspectives are unacknowledged or ignored), and that moderated internal dialogue or nonverbal ways of promoting internal communication can help.  \n "
  },
  {
    "title": "Intuition Pump",
    "body": "A thought experiment specifically constructed to focus the thinker’s attention on the salient, important properties of the problem under consideration (as opposed to one which either allows or even encourages the thinker to get bogged down in irrelevant or misleading detail).  \n "
  },
  {
    "title": "ITC",
    "body": "Immunity To Change, a framework developed by Lisa Lahey and Robert Kegan used for addressing bugs and problems that have been sticky and difficult-to-shift.  When engaging in ITC, participants list out desired behaviors that they would see if they had successfully solved their problem, blocking behaviors that they currently engage in, conflicting values that those blocking behaviors are trying to protect, underlying world models or beliefs about causality which put the blocking behaviors and desired behaviors into conflict, and possible experiments to test whether those conflicts are, in fact, inescapable.  \n "
  },
  {
    "title": "ITT",
    "body": "Ideological Turing Test.  The ability to restate an opposing viewpoint sufficiently well that a neutral observer listening to both you and your conversational partner would be at least 50% likely to guess that you truly held that position.  Often requested in debate or disagreement, i.e. \"would you be willing to try to pass my ITT?\" meaning \"would you be willing to try to state your model of my position in a way you believe I would endorse as accurate and charitable?\"  \n "
  },
  {
    "title": "Lego Principle",
    "body": "See “reductionism.”  \n "
  },
  {
    "title": "Map",
    "body": "Contrast with \"territory.\" A broad metaphor for one’s personal, mental model of the universe—one’s beliefs, intuitions, expectations, heuristics, predictions, memories, etc. Like an actual map, one’s personal map may be more or less accurate and more or less complete, and the differences between one’s map and the actual territory (reality) may cause one to become “lost” or confused (and to take action in inappropriate directions, given one’s goals).  \n "
  },
  {
    "title": "Metacognitive Blindspot",
    "body": "An area of one’s self-reflection or introspection which does not exist or returns inaccurate results, such as one’s internal sense of how capable one is of driving safely after a few drinks. Because metacognitive blindspots are derived from flaws in introspection, they often “hide their own existence,” such that, upon asking yourself whether or not you have one, you find yourself thinking “no.”  \n "
  },
  {
    "title": "Moloch",
    "body": "A shorthand for “things that go wrong despite the lack of any malicious intent,” usually in the context of systems and social dynamics. Moloch is a personified metaphor for tragedies-of-the-commons, prisoners’ dilemmas, Red Queen races, and all other situations in which local incentives lead to global disaster, first coined in an essay by Scott Alexander in 2014.  \n "
  },
  {
    "title": "Murphyjitsu",
    "body": "From Murphy’s Law, paraphrased as “whatever can go wrong, will go wrong.” Murphyjitsu is a specific, concrete algorithm for using one’s inner simulator to spot weaknesses and flaws in one’s plans, and for modifying them such that they become more comprehensive and robust. Typically, multiple cycles of Murphyjitsu will have additional but diminishing effect—a single round can halve the odds of failure, and another round can halve it again, and so on.  \n "
  },
  {
    "title": "Negative Visualization",
    "body": "A psychological technique derived from classical Stoic philosophy, in which one envisions bad potential outcomes for the people, things, groups, and endeavors one cares about, resulting in both increased emotional resilience to those outcomes and also greater in-the-moment appreciation for the current state of affairs.  \n "
  },
  {
    "title": "OODA Loops",
    "body": "Developed by John Boyd, a model of human cognition in which people repeatedly cycle through four phases: observe, orient, decide, act.  \n "
  },
  {
    "title": "Outside View",
    "body": "The “common sense” view, as derived from base rates, past experience, and observations of similar phenomena. Often used as a check on “inside view,” such as when estimating the length of time required to complete a task; the inside view asks “how long do I think this will take?” while the outside view asks “how long have things like this taken people like me, in the past?”  \n "
  },
  {
    "title": "Overlearning",
    "body": "A pedagogical theory stating that permanence and automaticity in newly-acquired skills requires practicing them well beyond the point of initial mastery. To “overlearn” a skill, one would not simply use it a handful of times in a few relevant contexts, but would instead spend a week or a month using it over and over again, until it was not only easy but reflexive and effortless.  \n "
  },
  {
    "title": "PCK",
    "body": "Pedagogical content knowledge, or the intersection between knowledge of teaching and knowledge of a specific domain. Understanding of PCK is the quality which separates good teachers and effective instruction from bad teachers and ineffective instruction; it includes an understanding of what it feels like to be a beginner in a particular domain, the ability to correctly identify the specific needs of a struggling student, and the expertise to know exactly which words, examples, and activities are likely to be helpful.  \n "
  },
  {
    "title": "Pica",
    "body": "A medical condition in which people who are (e.g.) iron deficient find themselves craving ice cubes, because a signal to eat things with iron is being distorted into an urge to eat things which share superficial properties with iron. Often used as a metaphor for actions which people take that are intended to meet a goal (often one that is not articulated) but are ill-suited to actually do so.  \n "
  },
  {
    "title": "Planning Fallacy",
    "body": "The tendency to model only best-case scenarios when generating plans, unconsciously underweighting or dismissing the likelihood of problems and delays.  \n "
  },
  {
    "title": "Polaris",
    "body": "A shorthand for “the ultimate goal” or “the guiding principle.” Typically referenced as a check to confirm that a given plan of action is, in fact, likely to move one toward one’s true terminal goals (“are you keeping your eyes on Polaris?”). See also “something to protect.”  \n "
  },
  {
    "title": "Prior",
    "body": "A given explicit belief and its estimated probability, for use in predictions and Bayesian updating. Typically, a prior is derived from background knowledge and base rates, prior to the application of specific or clarifying knowledge; to describe a belief based “on priors” is to take the outside view and state the most typical or likely case.  \n "
  },
  {
    "title": "Prisoner’s Dilemma",
    "body": "A classic problem in game theory in which agents are locally incentivized to take action which, if performed by all agents, leads to a globally worse outcome.  Two prisoners, each unable to communicate with the other, are offered the following choice: to *defect* on the other prisoner, giving information to their captors in exchange for a lighter sentence, or to *cooperate* with the other prisoner, keeping their mouths shut.  If both prisoners cooperate, they each receive a moderate sentence (e.g. two years).  If both defect, they each receive a harsh sentence (e.g. five years).  However, if one defects and the other does not, the defector receives a light sentence (e.g. one year) while the cooperator receives a harsh sentence (e.g. five years).  \n "
  },
  {
    "title": "Procedural Knowledge",
    "body": "Also called implicit knowledge. A type of knowledge that appears as action aimed at achieving an intended goal, but might or might not be something the knower can articulate. An example is the knowledge of how to ride a bicycle: that is knowledge that is defined in terms of a person’s ability to get on an actual bike and ride it, and many people have this skill even while being wrong about how they turn while riding. Sometimes procedural knowledge is simply called “skill.” Contrast with “declarative knowledge.”  \n "
  },
  {
    "title": "Quiche",
    "body": "A metaphorical allegory centered around following a rough-draft of a quiche recipe. In the allegory, it is better to try to “make good quiche” than to mindlessly follow the specific instructions when they may be significantly flawed. The term is used to remind people to stay sane, make good choices, synthesize their own versions of rationality techniques, etc.  Later replaced with the opening session advice \"eat the instructions.\"  \n "
  },
  {
    "title": "Rationality",
    "body": "The study and practice of thinking and acting in concert with reality, sometimes divided into epistemic and instrumental rationality. Epistemic rationality is concerned with the formation of true beliefs, and instrumental rationality with taking actions that are likely to bring about one’s desired outcomes; under some formulations of rationality, both are seen as emerging from the same core quality.  \n "
  },
  {
    "title": "Reductionism",
    "body": "Also referred to as “the LEGO principle;” the idea that things are made of parts, and that a correct and thorough understanding of the parts and their interactions is equivalent to an understanding of the whole. Metaphorically speaking, if one has explained the trees, shrubs, and fauna in all of their relevant detail, one has explained the forest; there is no ephemeral “missing” property that is forest-ness.  \n "
  },
  {
    "title": "Resolve Cycles",
    "body": "Formerly referred to as \"focused grit.\"  A technique for overcoming intimidation and hesitation involving short, focused bursts of high-effort brainstorming and problem solving, often in series. The classic example is the five-minute timer, in which one either attempts to directly solve a problem in five minutes, or to spend five minutes generating as many concrete actions as possible, each of which is theoretically doable in its own five-minute time slot.  \n "
  },
  {
    "title": "Revealed preference",
    "body": "The extrapolated or “discoverable” preference that explains one’s actual actions, whether those actions are in line with one’s stated preferences or not. One may easily claim that two activities are equally important, but if one reliably spends more time and effort on the first than on the second, one has, in practice, a clear preference.  \n "
  },
  {
    "title": "Schelling point",
    "body": "An obvious choice or referent that individuals reasoning independently of one another are likely to arrive at. For example, if one forgets the time of a lunch meeting, one is safest assuming noon; if one gets separated from one’s group on a skiing trip, the best place to wait is likely the largest, central ski lift.  \n "
  },
  {
    "title": "Scope Insensitivity",
    "body": "The tendency to weigh large quantities in ways that are inconsistent with one’s weighing of small quantities, such as when one’s reaction to the plight of (e.g.) 1000 animals endangered by an oil spill is not ten times greater than one’s reaction to 100 animals in the same circumstances.  \n "
  },
  {
    "title": "Shoulder Advisor",
    "body": "A mental model of a person, derived from one's aggregated experiences of that person. Often, consulting one's shoulder advisors can produce novel insights or ideas that one would not have normally thought of on one's own.  \"My shoulder Nate suggested X.\"  \n "
  },
  {
    "title": "Shoulds",
    "body": "Any pressures toward some particular action, whether external or internal.  \n "
  },
  {
    "title": "Signaling",
    "body": "A framework for evaluating actions, statements, and appearances on the basis of the tangential information they convey, as opposed to their direct or intended effect. For instance, an expensive suit signals wealth, conscientiousness, and conformity to professional norms; an inexpensive or ill-fitting suit may signal frugality, sloppiness, or a deliberate bucking of professional norms. Because signaling is subjective and both context- and reputation-dependent, it is often more valuable to take the outside view and ask “what could this action be interpreted as signaling?” rather than to say “I’ll signal X by doing Y.”  \n "
  },
  {
    "title": "SNS/PSNS",
    "body": "The sympathetic and parasympathetic nervous systems, each a branch of the autonomic nervous system, which modulates the “fight, flight, or freeze” adrenaline reaction. Both the SNS and the PSNS may be more or less active in a given moment; SNS activation tends to correlate with narrow, intense focus, high emotion, and decreased awareness of the body, while PSNS activation tends to correlate with calm, relaxation, and broad awareness of one’s body and environment.  \n "
  },
  {
    "title": "Socratic ducking",
    "body": "A technique for aiding a partner in the process of working through an idea or solving a problem, combining the concepts of “Socratic questioning” and “rubber ducking.” When playing a Socratic duck, one offers few direct suggestions or thoughts and instead alternates between challenging questions and silent attentiveness, encouraging one’s partner to follow complex threads and think deeply about the ramifications of various possible solutions.  \n "
  },
  {
    "title": "Something to protect",
    "body": "A shorthand for some subset of one’s goals or values that feel absolutely essential, such that one would exert full and unrestrained effort to defend them, and make significant sacrifices on their behalf. See also “Polaris.”  \n "
  },
  {
    "title": "Spaced repetition",
    "body": "A learning technique that calls for increasing intervals of time between subsequent reviews of previously learned material, in order to create deeper and more permanent memories.  \n "
  },
  {
    "title": "Sphexishness",
    "body": "Often thought of as the opposite of agency; the execution of rigid algorithms which create the appearance (but not the advantages) of intelligent thought or action. Based upon the behaviors of the sphex wasp, which seems to take reasoned, critical action during its search for food, but is in fact simply chaining together strings of simple trigger-action patterns.  \n "
  },
  {
    "title": "Spinning Plates",
    "body": "A kind of “productive mental wandering,” in reference to a story told by Richard Feynman in which deliberate attempts to generate novel physical theories failed, but following the thread of casual curiosity succeeded. Often used to remind individuals that there is value in rest, relaxation, appreciation of beauty, and changes of pace, e.g. “you’ve been working on that same bug all week; have you remembered to spend some time watching spinning plates?”  \n "
  },
  {
    "title": "Spoons",
    "body": "A colloquial term for discrete units of non-renewable energy or agency, such as the amount of agency required to write an email or run an errand or go to a party. Typically thought of as a resource which only decreases throughout the day, e.g. “I’m probably not going to make it to dance class tonight; I only woke up with four spoons and I’ve put them all down already.”  \n "
  },
  {
    "title": "Stag Hunt",
    "body": "A game theory problem similar to the prisoners' dilemma, in which a number of people must choose together whether to \"hunt stag\" (i.e. coordinate on a costly effort with a high likelihood of a large reward) or \"hunt rabbit\" (i.e. each engage in a much less costly activity with a high likelihood of a much smaller reward).  If most of the group chooses stag but one person chooses rabbit, then everyone who chose stag pays the high cost but no one receives the large reward.  \n "
  },
  {
    "title": "Subject-Object Shift",
    "body": "A change in one's orientation to some problem, feeling, dynamic, or situation, in which one shifts from being *subject to* whatever's happening, to being able to *take it as object.* When a small child drops their ice cream cone, the resulting disappointment is often all-consuming; they are subject to it.  When an adult drops their ice cream cone, they are often able to contextualize and \"be larger than\" their disappointment, taking it as object.  \n "
  },
  {
    "title": "Strategic Level",
    "body": "The level of thinking that is capable of producing novel insight and flexible, dynamic plans. When reacting to a failure or a mistake, basic, “ground-level” thinking produces pain and regret, while thinking on the tactical level generates next actions and strategies for recovery. Thinking on the strategic level, in contrast, leads one to ask questions like “how could I have predicted this, and better prepared for it?” and ”what ways of thinking and being will allow me to circumvent both similar and dissimilar failures in the future?”  \n "
  },
  {
    "title": "System 1/System 2",
    "body": "A two-part model of cognitive processes, originally proposed by psychologists Tversky and Kahneman. System 1 is the primal/automatic/intuitive brain—the source of reflexive action, quick answers, and cached responses, as well as most of our predictive and emotional machinery. System 2 is the deliberate/verbal/explicit brain—the source of our inner monologue and most of our conscious reasoning power. By understanding the strengths and weaknesses of each, and by effectively mediating conflicts within and between systems, individuals can improve their emotional resilience, problem-solving and decision-making capacities, and general quality of life.  \n "
  },
  {
    "title": "TAPs",
    "body": "A multi-use acronym, standing variously for “trigger-affect patterns,” “trigger-action patterns,” “trigger-affect plans,” and “trigger-action plans.” In general, the acronym TAPs refers to the idea that most of our thoughts and actions can be understood as predefined cause-effect chains, and that learning to identify those chains can both provide one with increased self-knowledge and also give one a tool for modifying one’s habits, behavior, and mood.  \n "
  },
  {
    "title": "Tarski, Alfred",
    "body": "A logician, mathematician, and philosopher, and generator of the core insight formalized as the Litany of Tarski, paraphrased as “if the sky is blue, I wish to believe the sky is blue; let me not become attached to beliefs I may not want.”  \n "
  },
  {
    "title": "Technical Problem",
    "body": "A problem where the path toward the solution is clear, involving known or knowable processes. While technical problems may be extremely complex or difficult, the difficulty is in executing the solution, rather than in discovering it. Contrast with “adaptive problems,” which contain unknown unknowns and often require a novel approach.  \n "
  },
  {
    "title": "Territory",
    "body": "A broad metaphor for the objective, real universe—the true state of affairs, the true laws of physics, etc. As with territory in the classic sense, our understanding of the universe is more detailed in some areas than others, more correct in some areas than others, and sometimes woefully incomplete; we remind one another that “the map is not the territory” so that we do not become too attached to our own explanations to notice where they are inaccurate.  \n "
  },
  {
    "title": "Ugh field",
    "body": "A vague and persistent aversion that can develop around some task or domain in which previous attempts to engage have been frustrating, painful, costly, or unsuccessful.  \n "
  },
  {
    "title": "Urge",
    "body": "An immediate, emotional drive; something one wants on a visceral level. Distinct from a goal, which is an explicit, long-term target. Urges may be “positive” or “attractive,” in that they draw one forward or promote a certain action, or they may be “negative” or “aversive,” in that they repel one or make a certain action less desirable and less likely.  \n "
  },
  {
    "title": "Utility",
    "body": "A theoretical unit of measure from economics, the utility of a given thought, object, or action is the amount of good it provides to the agent in question. Utility may be instrumental (as in the cases of wealth or education, which are useful and good because of what they lead to or enable), or it may be terminal (as in the case of happiness, which is the end goal of many endeavors).  \n "
  },
  {
    "title": "Verbal overshadowing",
    "body": "Classically, an effect whereby giving a verbal description of an assailant makes one less capable of identifying that assailant later in a lineup (compared to a control group that gave no verbal description at all). Metaphorically, an effect whereby “crystallizing” an idea, concept, or feeling into an explicit verbal model causes one to miss or ignore subtle-but-important de- tails which do not fit the simplified description.  \n "
  },
  {
    "title": "Virtue Ethics",
    "body": "An ethical theory holding that an action is right if it is what a virtuous agent would do under similar circumstances. Unlike consequentialism and deontology, virtue ethics asks the question “what sort of person should I be?”"
  }
]